Моделирование и анализ ПО
Моделирование ПО – это создание абстрактных, упрощенных моделей будущей или существующей программной системы до или в процессе ее написания кода.
Анализ ПО – это изучение созданных моделей и самой системы для проверки корректности, поиска ошибок, оценки качества, соответствования требованиям.
Ключевая суть: управление сложностью и снижать риски, проектируя систему на высоком уровне абстракции, где проще увидеть общую структуру.
Это нужно для: понимания и проектирования архитектуры, спецификации и документации, выявления ошибок, автоматизации.
Представляет собой набор графических нотаций для описания разных аспектов системы.
Применяется в разработке корпоративных ИС, разработке микросервисов, документирование существующих систем и тп.
Вывод: снижение ошибок, улучшение коммуникации в команде, создание документации
